---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CantKeepJoinTangent
source: html/6a6cd67e-f7e7-6ff5-cb3f-fa7f510f3c6e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CantKeepJoinTangent Property

Can't keep curve join tangent.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantKeepJoinTangent { get; }
```